

       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRIMERO.
       REMARKS. COMPILAR Y EJECUTAR.


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.


       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TEXTO PIC X(30) VALUE '... Y NO HA SIDO DIFICIL...'.


       PROCEDURE DIVISION.
       PROGRAMA SECTION.
       PROGRAMA-A.
           DISPLAY SPACE LINE 20 ERASE.
           DISPLAY 'ASIGNATURA: LABORATORIO DE PROGRAMACION'.
           DISPLAY 'PRUEBAS DE COMPILACION Y EJECUCION'.
           DISPLAY '...'.
           DISPLAY '... LA PRUEBA HA SIDO SATISFACTORIA ...'.
           DISPLAY TEXTO.
           DISPLAY '...'.
           STOP RUN.

